In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
zillow_2016_df=pd.read_csv('../CleanData/Zillow_2016avghomeval.csv')

In [3]:
zillow_2016_df.head()

,zipcode,city,state,metro,countyname,2016_avghomevalue
0,10065,New York,NY,New York-Newark-Jersey City,New York County,8959594
1,10075,New York,NY,New York-Newark-Jersey City,New York County,8299805
2,10021,New York,NY,New York-Newark-Jersey City,New York County,7677481
3,10014,New York,NY,New York-Newark-Jersey City,New York County,6369047
4,10128,New York,NY,New York-Newark-Jersey City,New York County,6354494

In [4]:
rds_connection_string = "postgres:Apartment606@localhost:5432/housing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [5]:
zillow_2016_df.to_sql(name='zillow_db', con=engine, if_exists='append', index=False)

In [6]:
pd.read_sql_query('select count(*) from zillow_db', con=engine).head()

   count
0  23307

In [10]:
zillow_2018_df=pd.read_csv('../CleanData/Zillow_2018avghomeval.csv')

In [11]:
zillow_2018_df.head()

,zipcode,city,state,metro,countyname,2018_avghomevalue
0,10065,New York,NY,New York-Newark-Jersey City,New York County,8779974
1,10075,New York,NY,New York-Newark-Jersey City,New York County,7859110
2,10021,New York,NY,New York-Newark-Jersey City,New York County,7397214
3,10128,New York,NY,New York-Newark-Jersey City,New York County,5937647
4,10014,New York,NY,New York-Newark-Jersey City,New York County,5687485

In [12]:
zillow_2018_df.to_sql(name='zillow_2018_db', con=engine, if_exists='append', index=False)

In [13]:
pd.read_sql_query('select count(*) from zillow_2018_db', con=engine).head()

   count
0  23307